{"id":17597,"date":"2023-09-13T14:10:57","date_gmt":"2023-09-13T14:10:57","guid":{"rendered":"https:\/\/sdbi.in\/?p=17597"},"modified":"2023-09-15T07:17:04","modified_gmt":"2023-09-15T07:17:04","slug":"what-is-the-future-of-data-science","status":"publish","type":"post","link":"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/","title":{"rendered":"WHAT IS THE FUTURE OF DATA SCIENCE ?"},"content":{"rendered":"<p>Welcome to an exciting journey into the future of data science! In this blog, we&#8217;ll unravel the captivating world of data science, breaking it down into six fascinating categories.<\/p>\n<p>First, we&#8217;ll look at the history of data science and how it became so popular in the quick-paced world of today. This field&#8217;s progress has been nothing short of amazing.<\/p>\n<p>We&#8217;ll next get into the five initial actions that data science normally takes. For a thorough understanding of the data science process, these phases must be understood.<\/p>\n<p>Then, we&#8217;ll take a detailed look at the tech world and how data science has woven itself into the very fabric of today&#8217;s technology. It provides a window into the core of innovation.<\/p>\n<p>We&#8217;ll also explore the huge benefits that data science provides for the future. Its effects are profound throughout industries, including banking, healthcare &amp; other industry.<\/p>\n<p>We&#8217;ll go through the degrees, qualifications, and fundamental abilities required for a successful career in this sector for individuals hoping to join the ranks of data scientists. It is a travel map for your data science endeavors.<\/p>\n<p>Finally, we&#8217;ll look at all of the opportunities for employment in the field of data science, highlighting the fascinating prospects that lie ahead.<\/p>\n<p>So buckle up as we set out on this thrilling path into the future of data science. There is information here for everyone, whether you are new with questions or a seasoned expert.<\/p>\n<p><strong>Let&#8217;s begin!<\/strong><\/p>\n<p>Data science is a revolution. With each passing minute and every piece of data that is produced, the potential for future business outcomes is becoming clear. Data scientists are providing the vision and drive to improve how businesses use data to improve their operations and ultimately lower costs while increasing top-line revenue.<\/p>\n<p>Data science has become the new buzzword in the business world, yet businesses have been slow to understand its importance. This post will examine why companies are unable to handle the data, not understanding it to make appropriate decisions and find solutions.<\/p>\n<p>Data Science is not new, but the ability to use it is. As companies struggle to handle their exponentially expanding data, data science has become essential for reshaping the way we think about marketing, sales and customer support in the future.<\/p>\n<h1><span style=\"font-weight: 400;\">Let’s start…&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;<\/span><\/h1>\n<h2>What is the future of data science?<\/h2>\n<p>Nothing less than a revolution is taking place in the field of data science, which is transforming the corporate environment one byte at a time. The ability of fresh data to alter future business results becomes more apparent with each passing second. The innovators who are advancing how organizations use data to improve operations, save costs, and increase top-line income are data scientists.<\/p>\n<p>But here&#8217;s the twist: while &#8220;data science&#8221; has become the buzzword of our times, many businesses are still struggling to grasp its true significance. They&#8217;re like ships adrift in a sea of data, not fully comprehending how to harness it for informed decisions and innovative solutions.<br \/>\nThe concept of data science isn&#8217;t new, but the power to wield it effectively is.<\/p>\n<p>Data science will be crucial in changing how we approach marketing, sales, and customer support in the future as data grows dramatically. It will fundamentally alter how companies of all sizes interact with their clients.<\/p>\n<p>However, difficulties abound. It is challenging for businesses to stay ahead due to inadequate IT infrastructure, a lack of competent personnel, and a constantly changing industry. Although they recognize the value of data science, they frequently find it difficult to adjust to its dynamic nature.<\/p>\n<p>Looking ahead, the future of data science offers a world in which developing technologies reduce the cost of intelligence collection. AI, augmented reality, and blockchain will be at the forefront, permanently altering the data environment. It&#8217;s a world in which robots, data abundance, and user-centric businesses are rewriting the rules.<\/p>\n<p>In essence, data science is the skill of discovering patterns in data and applying that information to make better business decisions. It is not a new concept, but its applications are limitless in this age of the internet. Data science combines business knowledge with mathematics, employing complicated algorithms to get business insights. It is critical not just for commerce, but also for illness forecasting, weather prediction, healthcare enhancement, and even fraud detection.<\/p>\n<p>So, whether you&#8217;re navigating the business world or the huge data-driven environment, keep in mind that data science is more than just a tool; it&#8217;s the compass that will lead us through the unexplored areas of our data-rich future.<\/p>\n<h2><span class=\"OYPEnA text-decoration-none text-strikethrough-none\">Five<\/span> <span class=\"OYPEnA text-decoration-none text-strikethrough-none\">Initials Steps of Data Scientist<\/span><b><\/b><\/h2>\n<h2><span class=\"OYPEnA text-decoration-none text-strikethrough-none\"><img loading=\"lazy\" class=\"wp-image-17605 alignright\" src=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Five-initials.png\" alt=\"\" width=\"343\" height=\"343\" srcset=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Five-initials.png 675w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Five-initials-300x300.png 300w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Five-initials-150x150.png 150w\" sizes=\"(max-width: 343px) 100vw, 343px\" \/><\/span><\/h2>\n<p><span class=\"OYPEnA text-decoration-none text-strikethrough-none\"><b>A data scientist must go through five steps, often known as the life cycle, before drawing any conclusions:<\/b><\/span><\/p>\n<p><b>Acquisition<\/b><span style=\"font-weight: 400;\"> &#8211; This is the data collection stage. The data collected here is unstructured raw data.<\/span><\/p>\n<p><b>Exploration<\/b><span style=\"font-weight: 400;\"> &#8211; This is the most time-consuming task on the path of life. Here the data is cleaned and marked as useful or useless. Data scientists translate it into a model ready for the next step.<\/span><\/p>\n<p><b>Modeling<\/b><span style=\"font-weight: 400;\"> &#8211; This is part of the data scientist&#8217;s process of looking at the data and deciding which model is best for the desired analysis.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><b>Analysis <\/b><span style=\"font-weight: 400;\">&#8211; This is the main part of the whole process. Perform various analyses of the data to get the desired results.<\/span><\/p>\n<p><span class=\"OYPEnA text-decoration-none text-strikethrough-none\"><b>Reporting<\/b><span style=\"font-weight: 400;\"> &#8211; The results obtained are presented in a readable format that can be a chart or just a report. Here the data is presented in an easy-to-understand format.<\/span><\/span><\/p>\n<h3><span class=\"OYPEnA text-decoration-none text-strikethrough-none\"><b>LET’S HAVE A LOOK INTO THE TECH WORLD…<\/b><span style=\"font-weight: 400;\">&#8230;&#8230;&#8230;&#8230;.<\/span><\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The future of data science is poised to usher in a significant transformation in data acquisition, analysis, and retention. Over the past decade, we&#8217;ve witnessed an explosion of data, driven by the proliferation of the Internet of Things (IoT) and the influence of social media. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Experts anticipate that the increasing prevalence of machines will lead to a surge in the utilization of computer systems and mobile devices in the coming years. Consumers are using social media not only for entertainment but also for business monitoring and more. Some prognosticators foresee a surge in the application of machine learning algorithms within the realm of social media.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The proliferation of the Internet of Things (IoT) and the ubiquity of social media platforms are expected to make Big Data even more integral to our daily lives. This transformation has already commenced, with some companies recognizing the immense value of data analytics. As a result, they are investing in platforms and acquiring messaging apps such as WhatsApp, Facebook Messenger, and Skype, among others. Even tech giants like Facebook and Google are acquiring software that streamlines the process of data collection, analysis, and interpretation, heralding a profound shift in our way of life.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It&#8217;s undeniable that Big Data is a hot topic in the present day. Unlike just a decade ago, the act of collecting and analyzing vast quantities of information has evolved into a highly lucrative, multibillion-dollar industry.<br \/>\n<\/span><\/p>\n<p><b>The future of data science is poised to make significant contributions as the volume of data on the Internet continues to grow exponentially. Data science will play a vital role in various fields, including:<img loading=\"lazy\" class=\"wp-image-17607 alignright\" src=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/DATA-SCIENCE-CONTRIBUTION-TO-THE-FUTURE.png\" alt=\"\" width=\"416\" height=\"416\" srcset=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/DATA-SCIENCE-CONTRIBUTION-TO-THE-FUTURE.png 675w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/DATA-SCIENCE-CONTRIBUTION-TO-THE-FUTURE-300x300.png 300w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/DATA-SCIENCE-CONTRIBUTION-TO-THE-FUTURE-150x150.png 150w\" sizes=\"(max-width: 416px) 100vw, 416px\" \/><\/b><b><\/b><\/p>\n<ol>\n<li><b> Image Recognition: <\/b><span style=\"font-weight: 400;\">With the increasing volume of data, companies can refine their image recognition systems. For example, consider Tesla&#8217;s self-driving cars, which rely on accurate road mapping. As more people drive the same routes repeatedly, the quality of these maps improves, enhancing the driving experience for others on the same roads<\/span><b>.<\/b><\/li>\n<li><b> Healthcare Advancement: <\/b><span style=\"font-weight: 400;\">The growing patient database will enable the healthcare system to identify gaps quickly. This data can aid governments in addressing impending health crises promptly and effectively.<\/span><\/li>\n<li><b> Weather Forecasting: <\/b><span style=\"font-weight: 400;\">Abundant historical data and powerful analytics tools may soon enable more accurate weather forecasting. This advancement could potentially save lives and reduce property damage by predicting and preparing for severe storms.<\/span><\/li>\n<li><b> Fraud Detection: <\/b><span style=\"font-weight: 400;\">Algorithms and artificial intelligence tools can swiftly identify and rectify fraudulent transactions, making financial systems more secure. AI has the potential to proactively prevent such activities as well.<\/span><\/li>\n<li><b> Gaming: <\/b><span style=\"font-weight: 400;\">Video game companies are increasingly leveraging data to enhance the gaming experience. Personal preferences and behavior data can be used to tailor games to individual players.<\/span><\/li>\n<li><b> Logistics: <\/b><span style=\"font-weight: 400;\">Advanced AI systems, like Google Maps, already provide route recommendations and real-time traffic updates. These systems can further evolve to address various logistical challenges, such as avoiding traffic accidents.<\/span><\/li>\n<li><b> Recommender Systems: <\/b>The entertainment industry is benefiting from data collected by apps and websites like Netflix, Amazon Prime, Disney+, and other OTT platforms. User browsing history serves as a valuable database, allowing these companies to provide personalized recommendations.<\/li>\n<\/ol>\n<p><b>As data science continues to advance, its applications will extend across diverse sectors, driving innovation and efficiency in various industries.<\/b><\/p>\n<h5><b>Data Scientist Degrees and Qualifications:<img loading=\"lazy\" class=\"alignleft wp-image-17609\" src=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Degree-Qualification.png\" alt=\"\" width=\"342\" height=\"342\" srcset=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Degree-Qualification.png 675w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Degree-Qualification-300x300.png 300w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Degree-Qualification-150x150.png 150w\" sizes=\"(max-width: 342px) 100vw, 342px\" \/><\/b><\/h5>\n<p><span style=\"font-weight: 400;\">Data scientists come from diverse educational backgrounds and follow various pathways to success in this dynamic field. They serve as modern-day explorers, navigating the intricate world of data using knowledge from various disciplines. The field of data science offers a range of educational options, and specialized programs are on the rise, nurturing the next generation of data specialists.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For those eager to embark on this journey straight out of high school, the first step is obtaining a <strong>BSc in Data Science &amp; Business Analytics<\/strong>. This foundational program equips students with the skills needed to enter the field of data science. Importantly, data science provides not only a variety of starting points but also opportunities to pivot. Graduates looking for new directions have numerous choices. They can pursue an <strong>MSc in Data Science &amp; Big Data Analytics<\/strong>, delving deeper into the complexities of data. Alternatively, a <strong>Post Graduation Diploma in Data Science<\/strong> offers a specialized and expedited pathway. These programs are accredited by the <strong>University of Mumbai<\/strong> through the <strong>School of Data Science &amp; Business Intelligence<\/strong> &amp; its globally recognized degrees. In today&#8217;s interconnected and diverse world, this recognition holds significant value.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">But what if you lack formal training or a degree in data science? Diversity is highly appreciated in the field of data science. Candidates with diverse educational backgrounds, such as computer science, statistics, and information technology, can seamlessly transition into the field. Advanced degrees in statistics or mathematics can be particularly helpful, as they enhance problem-solving abilities. The demand for programmers has also made computer science degrees increasingly popular.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Regardless of their educational backgrounds, individuals entering data science must possess a deep understanding of both technical programming and the intricacies of business operations. In the end, data science welcomes those who are willing to study, analyze, and derive insights from the ever-expanding world of data, whether they are recent high school graduates or professionals changing careers. While qualifications may vary, the thirst for knowledge remains a constant driving force.<\/span><\/p>\n<h5><b>Skills Data Scientists Should Focus on<img loading=\"lazy\" class=\"wp-image-17608 alignright\" src=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/10-Skills-Data-Scientists-Should-Focus-on.png\" alt=\"\" width=\"345\" height=\"345\" srcset=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/10-Skills-Data-Scientists-Should-Focus-on.png 675w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/10-Skills-Data-Scientists-Should-Focus-on-300x300.png 300w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/10-Skills-Data-Scientists-Should-Focus-on-150x150.png 150w\" sizes=\"(max-width: 345px) 100vw, 345px\" \/><\/b><\/h5>\n<ol>\n<li><span style=\"font-weight: 400;\"><strong> SAS<\/strong> stands for Statistical Analysis Software. It is used for information management, analysis, and reporting.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> MATLAB<\/strong> This software is used to clean and analyze complex.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> R<\/strong> is a programming language with data, statistical computing&amp; graphics support.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> SQL<\/strong> is a programming language for data management.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> Hadoop<\/strong> is a Java-based language for processing big data. It is gaining popularity, but it is not necessary to be a data scientist. These technical skills are essential for data scientists to excel in their field. But if a data scientist wants to excel, he must work on the following non-technical skills.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> Understanding the <strong>Business Acumen<\/strong> is critical if a business data scientist wants to take an organization to the next level. Solving organizational problems should be a data scientist’s primary focus.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> Communication skills<\/strong> and soft skills are essential requirements for any job<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> Statistics<\/strong> one of the important parts of data science. The analyzed data is presented in one of two inferential or descriptive forms.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong>Mathematics<\/strong> Mathematical topics such as probability and linear algebra play an important role in the study and practice of data science.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong>Analytics<\/strong> Analytical Reasoning Finding solutions to complex problems is a daily task for data scientists. Training your brain to think logically is a skill that a data scientist can acquire.<\/span><\/li>\n<\/ol>\n<h5><strong>Data Science Jobs<img loading=\"lazy\" class=\"wp-image-17606 alignright\" src=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Data-Science-Job.png\" alt=\"\" width=\"376\" height=\"376\" srcset=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Data-Science-Job.png 675w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Data-Science-Job-300x300.png 300w, https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/Data-Science-Job-150x150.png 150w\" sizes=\"(max-width: 376px) 100vw, 376px\" \/> <\/strong><\/h5>\n<p><span style=\"font-weight: 400;\">Data has applications in nearly every field, and data scientists play a crucial role in helping companies make informed decisions, contributing to their growth. There are three primary types of careers in data science:<\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\"><strong> Data Analyst:<\/strong> Data analysts focus on processing data and summarizing the results.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> Data Scientists:<\/strong> Data scientists are responsible for analyzing results and creating models to interpret large datasets.<\/span><\/li>\n<li><span style=\"font-weight: 400;\"><strong> Data Engineer:<\/strong> Data engineers work on creating and maintaining data warehouses with constantly shifting loads. These roles are closely related and can sometimes overlap. For example, a data scientist may also perform the duties of a data engineer.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">In addition to these roles, there are other key positions within the data science field:<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Database Administrator:<\/strong> Database administrators are in charge of assuring the smooth operation of all company databases. They control access to these databases, backups, and recoveries.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Machine Learning Engineer:<\/strong> Machine learning engineers are in high demand and must be well-versed in technologies such as SQL and REST APIs. They also do A\/B testing, data pipeline construction, and machine learning algorithm implementation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Data Architect:<\/strong> Data architects provide data management solutions that allow databases to be easily connected, centralised, and protected by effective security mechanisms. They also supply data engineers with the tools and technologies they require.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Statistician: <\/strong>Statisticians are well-versed in statistical theory and data organisation. They not only extract useful insights from data, but they also create new approaches for data engineers to use.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Business Analyst:<\/strong> Business analysts have a unique position in data science. They are familiar with data-driven technology and how to manage big amounts of data. Their key responsibility is to discriminate between high-value and low-value data and to determine how Big Data may be translated into useful business insights for business success.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>&#8211; Data and Analytics Manager:<\/strong> Data and analytics managers manage data science operations and delegate work to their teams depending on their abilities and knowledge. They should be knowledgeable in technologies such as SAS, R, and SQL, as well as have good managerial abilities.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">These various roles collectively contribute to the field of data science, where professionals work together to harness the power of data for informed decision-making and business success.<\/span><\/p>\n<h6><b>CONCLUSION:<\/b><\/h6>\n<p><span style=\"font-weight: 400;\">Data science seamlessly integrates business acumen with mathematical brilliance, aided by complicated algorithms, to solve the mysteries of business intelligence. This framework enables you to build predictive models that will help your company make better decisions.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although not wholly new, the use of data science has increased dramatically in our internet-driven age. Data, which includes analytics and storage, has evolved into a valuable resource. Facebook and Google are investing in technologies to exploit the massive amounts of data created by everyday people. Big Data is the future, and we&#8217;re well-positioned to succeed in this emerging frontier.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Consider this: the evolution of data science parallels the evolution of the computing industry over the last two decades. Computers, which were once only instruments for productivity, are now a vital part of our everyday lives, connecting, entertaining, teaching, and safeguarding us.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As we look ahead, one fact is undeniable: the need for data scientists is increasing, with firms making significant expenditures in this sector. You may pave your road to a bright career in data science by taking the correct measures. We hope that this blog has enlightened your route by providing insights for going on your own journey in this ever-changing universe.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, take the moment, investigate the possibilities, and let the realm of data science to reveal your limitless potential. Your future is calling!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Welcome to an exciting journey into the future of data science! In this blog, we&#8217;ll unravel the captivating world of data science, breaking it down into six fascinating categories. First, we&#8217;ll look at the history of data science and how it became so popular in the quick-paced world of today. This field&#8217;s progress has been [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":17610,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[58],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.0.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>WHAT IS THE FUTURE OF DATA SCIENCE ? - School of Data Science and Business Intelligence<\/title>\n<link rel=\"canonical\" href=\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"WHAT IS THE FUTURE OF DATA SCIENCE ? - School of Data Science and Business Intelligence\" \/>\n<meta property=\"og:description\" content=\"Welcome to an exciting journey into the future of data science! In this blog, we&#8217;ll unravel the captivating world of data science, breaking it down into six fascinating categories. First, we&#8217;ll look at the history of data science and how it became so popular in the quick-paced world of today. This field&#8217;s progress has been [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\" \/>\n<meta property=\"og:site_name\" content=\"School of Data Science and Business Intelligence\" \/>\n<meta property=\"article:published_time\" content=\"2023-09-13T14:10:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T07:17:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/What-is-the-Future-of-Data-Science.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"628\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"13 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sdbi.in\/#website\",\"url\":\"https:\/\/sdbi.in\/\",\"name\":\"School of Data Science and Business Intelligence\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/sdbi.in\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/sdbi.in\/wp-content\/uploads\/2023\/09\/What-is-the-Future-of-Data-Science.jpg\",\"width\":1200,\"height\":628},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/#webpage\",\"url\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\",\"name\":\"WHAT IS THE FUTURE OF DATA SCIENCE ? - School of Data Science and Business Intelligence\",\"isPartOf\":{\"@id\":\"https:\/\/sdbi.in\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/#primaryimage\"},\"datePublished\":\"2023-09-13T14:10:57+00:00\",\"dateModified\":\"2023-09-15T07:17:04+00:00\",\"author\":{\"@id\":\"https:\/\/sdbi.in\/#\/schema\/person\/28d16f5a87d2ba4395c39fd8616f84d6\"},\"breadcrumb\":{\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sdbi.in\/\",\"url\":\"https:\/\/sdbi.in\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\",\"url\":\"https:\/\/sdbi.in\/what-is-the-future-of-data-science\/\",\"name\":\"WHAT IS THE FUTURE OF DATA SCIENCE ?\"}}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/sdbi.in\/#\/schema\/person\/28d16f5a87d2ba4395c39fd8616f84d6\",\"name\":\"bobby sdbi\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/sdbi.in\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8bbfe7d40fe8057c1553cc61bd208722?s=96&d=mm&r=g\",\"caption\":\"bobby sdbi\"},\"sameAs\":[\"https:\/\/sdbi.in\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/posts\/17597"}],"collection":[{"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/comments?post=17597"}],"version-history":[{"count":5,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/posts\/17597\/revisions"}],"predecessor-version":[{"id":17613,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/posts\/17597\/revisions\/17613"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/media\/17610"}],"wp:attachment":[{"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/media?parent=17597"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/categories?post=17597"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sdbi.in\/wp-json\/wp\/v2\/tags?post=17597"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}